spec/cassettes/Providers_CheckBenefitsController/GET_/providers/applications/_application_id/check_benefit/generates_a_new_check_benefit_result.yml

---
http_interactions:
- request:
    method: post
    uri: https://benefitchecker.stg.legalservices.gov.uk/lsx/lsc-services/benefitChecker?wsdl
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?> <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsdl="https://lsc.gov.uk/benefitchecker/service/1.0/API_1.0_Check"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"> <env:Body> <wsdl:check>
        <wsdl:clientReference>86e952d7-81e9-4533-8e6b-d3d32e8c3252</wsdl:clientReference>
        <wsdl:nino>JA293483A</wsdl:nino> <wsdl:surname>WALKER</wsdl:surname> <wsdl:dateOfBirth>19800110</wsdl:dateOfBirth>
        <wsdl:dateOfAward>20250610</wsdl:dateOfAward> <wsdl:lscServiceName><BC_LSC_SERVICE_NAME></wsdl:lscServiceName>
        <wsdl:clientOrgId><BC_CLIENT_ORG_ID></wsdl:clientOrgId> <wsdl:clientUserId><BC_CLIENT_USER_ID></wsdl:clientUserId>
        </wsdl:check> </env:Body> </env:Envelope>
    headers:
      Soapaction:
      - "#POST"
      Content-Type:
      - text/xml
      User-Agent:
      - Faraday v2.13.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: ''
    headers:
      Date:
      - Tue, 10 Jun 2025 10:40:14 GMT
      Content-Type:
      - text/xml;charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      X-Amzn-Trace-Id:
      - Root=1-68480b8e-4b4a8eaa412ce72479e6dbb3;
      Vary:
      - Accept-Encoding
    body:
      encoding: ASCII-8BIT
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><benefitCheckerResponse
        xmlns="https://lsc.gov.uk/benefitchecker/service/1.0/API_1.0_Check"><ns1:originalClientRef
        xmlns:ns1="http://lsc.gov.uk/benefitchecker/data/1.0">86e952d7-81e9-4533-8e6b-d3d32e8c3252</ns1:originalClientRef><ns2:benefitCheckerStatus
        xmlns:ns2="http://lsc.gov.uk/benefitchecker/data/1.0">Yes</ns2:benefitCheckerStatus><ns3:confirmationRef
        xmlns:ns3="http://lsc.gov.uk/benefitchecker/data/1.0">T1749552014230</ns3:confirmationRef></benefitCheckerResponse></soapenv:Body></soapenv:Envelope>
  recorded_at: Tue, 10 Jun 2025 10:40:14 GMT
recorded_with: VCR 6.3.1
